#include "PiecesOfCode.hpp"

/*
# ========================================================================================= #
# Pieces Of Code
# ========================================================================================= #
*/

namespace PiecesOfCode
{
	const std::string TArray_Iterator =
		"template<typename TArray>\n"
		"class TIterator\n"
		"{\n"
		"public:\n"
		"\tusing ElementType = typename TArray::ElementType;\n"
		"\tusing ElementPointer = ElementType*;\n"
		"\tusing ElementReference = ElementType&;\n"
		"\tusing ElementConstReference = const ElementType&;\n"
		"\n"
		"private:\n"
		"\tElementPointer IteratorData;\n"
		"\n"
		"public:\n"
		"\tTIterator(ElementPointer inElementPointer)\n"
		"\t{\n"
		"\t\tIteratorData = inElementPointer;\n"
		"\t}\n"
		"\n"
		"public:\n"
		"\tTIterator& operator++()\n"
		"\t{\n"
		"\t\tIteratorData++;\n"
		"\t\treturn *this;\n"
		"\t}\n"
		"\n"
		"\tTIterator operator++(int32_t)\n"
		"\t{\n"
		"\t\tTIterator iteratorCopy = *this;\n"
		"\t\t++(*this);\n"
		"\t\treturn iteratorCopy;\n"
		"\t}\n"
		"\n"
		"\tTIterator& operator--()\n"
		"\t{\n"
		"\t\tIteratorData--;\n"
		"\t\treturn *this;\n"
		"\t}\n"
		"\n"
		"\tTIterator operator--(int32_t)\n"
		"\t{\n"
		"\t\tTIterator iteratorCopy = *this;\n"
		"\t\t--(*this);\n"
		"\t\treturn iteratorCopy;\n"
		"\t}\n"
		"\n"
		"\tElementReference operator[](int32_t index)\n"
		"\t{\n"
		"\t\treturn *(IteratorData[index]);\n"
		"\t}\n"
		"\n"
		"\tElementPointer operator->()\n"

		"\t\treturn ArrayData[index];\n"
		"\t}\n"
		"\n"
		"\tElementReference operator[](int32_t index)\n"
		"\t{\n"
		"\t\treturn ArrayData[index];\n"
		"\t}\n"
		"\n"
		"\tElementConstReference At(int32_t index) const\n"
		"\t{\n"
		"\t\treturn ArrayData[index];\n"
		"\t}\n"
		"\n"
		"\tElementReference At(int32_t index)\n"
		"\t{\n"
		"\t\treturn ArrayData[index];\n"
		"\t}\n"
		"\n"
		"\tvoid Add(ElementConstReference newElement)\n"
		"\t{\n"
		"\t\tif (ArrayCount >= ArrayMax)\n"
		"\t\t{\n"
		"\t\t\tReAllocate(sizeof(ElementType) * (ArrayCount + 1));\n"
		"\t\t}\n"
		"\n"
		"\t\tnew(&ArrayData[ArrayCount]) ElementType(newElement);\n"
		"\t\tArrayCount++;\n"
		"\t}\n"
		"\n"
		"\tvoid Add(ElementReference& newElement)\n"
		"\t{\n"
		"\t\tif (ArrayCount >= ArrayMax)\n"
		"\t\t{\n"
		"\t\t\tReAllocate(sizeof(ElementType) * (ArrayCount + 1));\n"
		"\t\t}\n"
		"\n"
		"\t\tnew(&ArrayData[ArrayCount]) ElementType(newElement);\n"
		"\t\tArrayCount++;\n"
		"\t}\n"
		"\n"
		"\tvoid PopBack()\n"
		"\t{\n"
		"\t\tif (ArrayCount > 0)\n"
		"\t\t{\n"
		"\t\t\tArrayCount--;\n"
		"\t\t\tArrayData[ArrayCount].~ElementType();\n"
		"\t\t}\n"
		"\t}\n"
		"\n"
		"\tvoid Clear()\n"
		"\t{\n"
		"\t\tfor (int32_t i = 0; i < ArrayCount; i++)\n"
		"\t\t{\n"
		"\t\t\tArrayData[i].~ElementType();\n"
		"\t\t}\n"
		"\n"
		"\t\tArrayCount = 0;\n"
		"\t}\n"
		"\n"
		"\tint32_t Num() const\n"
		"\t{\n"
		"\t\treturn ArrayCount;\n"
		"\t}\n"
		"\n"
		"\tint32_t Max() const\n"
		"\t{\n"
		"\t\treturn ArrayMax;\n"
		"\t}\n"
		"\n"
		"\tIterator begin()\n"
		"\t{\n"
		"\t\treturn Iterator(ArrayData);\n"
		"\t}\n"
		"\n"
		"\tIterator end()\n"
		"\t{\n"
		"\t\treturn Iterator(ArrayData + ArrayCount);\n"
		"\t}\n"
		"\n"
		"private:\n"
		"\tvoid ReAllocate(int32_t newArrayMax)\n"
		"\t{\n"
		"\t\tElementPointer newArrayData = (ElementPointer)::operator new(newArrayMax * sizeof(ElementType));\n"
		"\t\tint32_t newNum = ArrayCount;\n"
		"\n"
		"\t\tif (newArrayMax < newNum)\n"
		"\t\t{\n"
		"\t\t\tnewNum = newArrayMax;\n"
		"\t\t}\n"
		"\n"
		"\t\tfor (int32_t i = 0; i < newNum; i++)\n"
		"\t\t{\n"
		"\t\t\tnew(newArrayData + i) ElementType(std::move(ArrayData[i]));\n"
		"\t\t}\n"
		"\n"
		"\t\tfor (int32_t i = 0; i < ArrayCount; i++)\n"
		"\t\t{\n"
		"\t\t\tArrayData[i].~ElementType();\n"
		"\t\t}\n"
		"\n"
		"\t\t::operator delete(ArrayData, ArrayMax * sizeof(ElementType));\n"
		"\t\tArrayData = newArrayData;\n"
		"\t\tArrayMax = newArrayMax;\n"
		"\t}\n"
		"};\n";

		const std::string TMap_Class =
			"template<typename TKey, typename TValue>\n"
			"class TMap\n"
			"{\n"
			"private:\n"
			"\tstruct TPair\n"
			"\t{\n"
			"\t\tTKey Key;\n"
			"\t\tTValue Value;\n"
			"\t};\n"
			"\n"
			"public:\n"
			"\tusing ElementType = TPair;\n"
			"\tusing ElementPointer = ElementType*;\n"
			"\tusing ElementReference = ElementType&;\n"
			"\tusing ElementConstReference = const ElementType&;\n"
			"\tusing Iterator = TIterator<TArray<ElementType>>;\n"
			"\n"
			"public:\n"
			"\tTArray<ElementType> Elements;\t\t\t\t\t\t\t\t\t// 0x0000 (0x0010)\n"
			"\tuintptr_t IndirectData;\t\t\t\t\t\t\t\t\t\t\t// 0x0010 (0x0008)\n"
			"\tint32_t InlineData[0x4];\t\t\t\t\t\t\t\t\t\t// 0x0018 (0x0010)\n"
			"\tint32_t NumBits;\t\t\t\t\t\t\t\t\t\t\t\t// 0x0028 (0x0004)\n"
			"\tint32_t MaxBits;\t\t\t\t\t\t\t\t\t\t\t\t// 0x002C (0x0004)\n"
			"\tint32_t FirstFreeIndex;\t\t\t\t\t\t\t\t\t\t\t// 0x0030 (0x0004)\n"
			"\tint32_t NumFreeIndices;\t\t\t\t\t\t\t\t\t\t\t// 0x0034 (0x0004)\n"
			"\tint64_t InlineHash;\t\t\t\t\t\t\t\t\t\t\t\t// 0x0038 (0x0008)\n"
			"\tint32_t* Hash;\t\t\t\t\t\t\t\t\t\t\t\t\t// 0x0040 (0x0008)\n"
			"\tint32_t HashCount;\t\t\t\t\t\t\t\t\t\t\t\t// 0x0048 (0x0004)\n"
			"\n"
			"public:\n"
			"\tTMap() :\n"
			"\t\tIndirectData(NULL),\n"
			"\t\tNumBits(0),\n"
			"\t\tMaxBits(0),\n"
			"\t\tFirstFreeIndex(0),\n"
			"\t\tNumFreeIndices(0),\n"
			"\t\tInlineHash(0),\n"
			"\t\tHash(nullptr),\n"
			"\t\tHashCount(0)\n"
			"\t{\n"
			"\n"
			"\t}\n"
			"\n"
			"\tTMap(struct FMap_Mirror& unrealMap) :\n"
			"\t\tIndirectData(NULL),\n"
			"\t\tNumBits(0),\n"
			"\t\tMaxBits(0),\n"
			"\t\tFirstFreeIndex(0),\n"
			"\t\tNumFreeIndices(0),\n"
			"\t\tInlineHash(0),\n"
			"\t\tHash(nullptr),\n"
			"\t\tHashCount(0)\n"
			"\t{\n"
			"\t\t*this = *reinterpret_cast<TMap<TKey, TValue>*>(&unrealMap);\n"
			"\t}\n"
			"\n"
			"\t~TMap() {}\n"
			"\n"
			"public:\n"
			"\tint32_t Num() const\n"
			"\t{\n"
			"\t\treturn Elements.Num();\n"
			"\t}\n"
			"\n"
			"\tint32_t Max() const\n"
			"\t{\n"
			"\t\treturn Elements.Max();\n"
			"\t}\n"
			"\n"
			"\tElementConstReference At(int32_t index) const\n"
			"\t{\n"
